Итог/EDT_итог/src/Documents/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Продажи</name>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Итог/EDT_итог/src/Documents/Продажи/Forms/DocumentForm/Module.bsl
&AtClient
Procedure ТоварыКоличествоOnChange(Item)
	ТекДата = Элементы.Товары.ТекущиеДанные;
	ТекДата.Сумма = ТекДата.Количество * ТекДата.Цена;
EndProcedure

&AtClient
Procedure ТоварыСуммаOnChange(Item)
	ТекДата = Элементы.Товары.ТекущиеДанные;
	Если ТекДата.Количество = 0 Тогда
		ТекДата.Цена = 0;
	Иначе
		ТекДата.Цена = ТекДата.Сумма / ТекДата.Количество;
	КонецЕсли;
EndProcedure

&AtClient
Procedure ТоварыЦенаOnChange(Item)
	ТекДата = Элементы.Товары.ТекущиеДанные;
	ТекДата.Сумма = ТекДата.Количество * ТекДата.Цена;
EndProcedure
